[
    {
        "title": "Date et durée du stage",
        "content": "Le stage s'est déroulé du 13 mai au 18 juillet. Les deux premières semaines ont été en demi-semaine, soit une période de quatre semaines pour ces deux semaines combinées. Le reste du stage s'est effectué à temps plein."
    },
    {
        "title": "Présentation de l'entreprise",
        "content": "Introduction\nAsiaction est une société spécialisée dans la gestion de projets d'achats en Asie, principalement en Chine. Sa mission est de garantir la réussite des projets de ses clients en combinant des ressources techniques et humaines tout au long du processus d'approvisionnement.\n\nServices Principaux\n- Étude Sourcing : Identification et validation de fournisseurs chinois, fourniture d'offres conformes aux besoins des clients avec détails sur les prix et certifications.\n- Vérification de Société : Validation des documents légaux et certifications des entreprises, rapport détaillé avec illustrations.\n- Audit d’Usine : Évaluation de la fiabilité des usines, observation des lignes de production, et rapport complet avec photos et avis de l’auditeur.\n- Accompagnement Échantillonnage : Élaboration et vérification des échantillons, optimisation du transport des échantillons.\n- Gestion de Commande : Négociation des conditions d’achat, suivi de la production, inspection qualité des produits finis.\n- Inspection Produit : Contrôle qualité, vérification des spécifications, tests de fonctionnement, et rapport détaillé.\n- Supervision de Chargement : Vérification des conteneurs et supervision du chargement avec rapport complet.\n\nPhilosophie et Promesse\nAsiaction s’engage à éviter les incompréhensions culturelles et linguistiques grâce à des interlocuteurs francophones. Ils assurent la fiabilité des informations et offrent des conseils personnalisés, visant à minimiser les problèmes post-vente et à consolider l'image de marque des clients.\n\nImplantation et Expérience\nAvec des bureaux à Londres, Guangzhou, Bordeaux, et Dubaï, et une grande expérience dans l’importation de produits chinois, Asiaction a identifié plus de 2 400 usines, se positionnant comme un partenaire de confiance pour gérer efficacement les projets d'achats en Asie.\n\nAvantages de Travailler avec Asiaction\n- Expertise technique et humaine : Agents expérimentés pour un suivi rigoureux.\n- Communication fluide : Interlocuteurs francophones pour éviter les malentendus.\n- Réduction des risques : Vérification approfondie des fournisseurs.\n- Optimisation Logistique : Solutions de transport optimisées pour réduire les coûts et respecter les délais.\n\nPour plus de détails, Asiaction propose des documents téléchargeables sur leurs services spécifiques.\n\nConclusion\nAsiaction se présente comme le partenaire idéal pour gérer vos projets d'achats en Asie, offrant une gamme complète de services pour assurer la réussite et la sécurité de vos transactions."
    },
    {
        "title": "Mais en fait, c'est quoi AWS ?",
        "content": "AWS, ou Amazon Web Services, est une plateforme de services cloud proposée par Amazon. Elle permet aux entreprises et aux développeurs d'accéder à une large gamme de services informatiques via Internet, sans avoir besoin de gérer physiquement des serveurs ou des infrastructures.\n\nPoints Clés pour Comprendre AWS\n- Services Cloud : AWS offre des services en ligne comme le stockage de données, la puissance de calcul, les bases de données, et bien plus encore. Plutôt que d'acheter et de maintenir des serveurs, les utilisateurs peuvent louer ces services en fonction de leurs besoins.\n- Scalabilité : AWS permet aux utilisateurs d'ajuster facilement la quantité de ressources informatiques qu'ils utilisent. Si ton application a besoin de plus de puissance pendant une période de forte demande, AWS peut automatiquement augmenter les ressources disponibles.\n- Coût : Avec AWS, tu ne paies que pour ce que tu utilises. Cela rend les coûts beaucoup plus flexibles et souvent plus abordables que d'investir dans une infrastructure matérielle traditionnelle.\n- Outils et Services Spécialisés : AWS propose des services spécialisés pour différents types de projets, notamment l'intelligence artificielle (IA), l'Internet des objets (IoT), l'analyse de données, et bien d'autres. Par exemple, Amazon SageMaker est un outil AWS qui permet de créer, entraîner, et déployer des modèles d'IA facilement.\n\nEn résumé, AWS est une solution puissante pour les entreprises et les développeurs qui souhaitent accéder à des ressources informatiques flexibles et à des outils spécialisés sans avoir à investir massivement dans du matériel."
    },
    {
        "title": "Première semaine dans l'entreprise",
        "content": "Lors de ma première semaine chez Asiaction, j'ai été introduit au projet qui allait constituer le cœur de mon stage : la mise en place d'une solution d'intelligence artificielle pour améliorer la sélection de mobilier. Cette tâche représentait un défi passionnant, mais également complexe. Pour bien débuter, j'ai passé du temps à comprendre les objectifs du projet, les attentes de l'équipe, et les ressources à ma disposition. \n\nLa première phase de mon travail a été consacrée à la recherche de solutions possibles, en explorant les différentes approches techniques qui pourraient être adaptées à ce contexte spécifique. J'ai entamé la rédaction d'un plan de projet qui devait servir de guide tout au long du développement. Ce plan comprenait les étapes principales, les outils potentiels, et les défis que j'avais déjà anticipés. Parallèlement, j'ai commencé à faire un inventaire des outils et technologies qui pourraient être nécessaires pour mener à bien cette mission, ce qui a posé les premières bases de mon travail."
    },
    {
        "title": "Deuxième semaine",
        "content": "Durant la deuxième semaine, j'ai commencé à plonger dans le vif du sujet en utilisant les premiers outils nécessaires pour le projet. Cette étape a été particulièrement difficile car j'abordais des technologies qui m'étaient totalement nouvelles. J'ai initialement essayé de me familiariser avec les solutions proposées par Google, mais j'ai rapidement compris que celles-ci ne répondaient pas parfaitement aux exigences du projet. \n\nC'est ainsi que je me suis tourné vers AWS (Amazon Web Services), une plateforme qui était inconnu pour moi. La transition vers AWS a été un défi en soi : l'interface utilisateur s'est révélée peu intuitive et la documentation fournie, bien que complète, n'était pas toujours facile à suivre. Malgré ces obstacles, j'ai persévéré dans l'apprentissage de ces outils, conscient de leur importance pour la réussite du projet. Cette semaine a été marquée par de nombreux moments de frustration, mais aussi par des petits succès qui m'ont permis de gagner en confiance."
    },
    {
        "title": "Semaine 3: Premiers Codes",
        "content": "Lors de la troisième semaine, j'ai franchi une étape cruciale en commençant à écrire les premiers morceaux de code pour le projet. Mon objectif principal était de développer une fonctionnalité permettant de rechercher et d'extraire des images contenues dans des fichiers PDF. Cette tâche technique s'est avérée complexe, mais elle était essentielle pour la suite du projet, qui devait s'appuyer sur une base solide de données visuelles. \n\nJ'ai passé de nombreuses heures à tester différents algorithmes et bibliothèques, à évaluer leur performance et leur précision dans le contexte spécifique des documents PDF fournis. Le travail sur cette fonctionnalité a demandé une grande rigueur et une attention particulière aux détails, car chaque erreur pouvait compromettre l'ensemble du processus d'extraction."
    },
    {
        "title": "Semaine 4: Extraction et Base de Données",
        "content": "La quatrième semaine a été particulièrement intense et décisive pour l'avancement du projet. Après avoir posé les bases techniques avec l'écriture des premiers codes, il était temps de passer à l'extraction massive des images et à la mise en place d'une infrastructure permettant de stocker ces données de manière organisée et sécurisée."
    },
    {
        "title": "Semaine 5: Mise en Place et Premiers Tests",
        "content": "La cinquième semaine a marqué une étape importante dans le projet, avec la mise en place du système développé dans un environnement web pour les premiers tests à grande échelle. J'ai commencé par intégrer le projet dans un site web dédié, ce qui a permis de visualiser concrètement les fonctionnalités développées au cours des semaines précédentes. L'une des tâches principales a été l'ajout de plusieurs centaines de fichiers PDF au système, suivi de l'extraction des images contenues dans ces documents. \n\nCes tests à grande échelle ont été essentiels pour identifier les points faibles et les bugs du système. J'ai dû faire face à plusieurs problèmes, notamment des erreurs lors de l'extraction d'images spécifiques, des temps de traitement plus longs que prévu, et des incohérences dans la structuration des données. Cette semaine a été en grande partie consacrée à déboguer ces problèmes, en ajustant les algorithmes et en optimisant les performances du système pour garantir sa fiabilité et son efficacité."
    },
    {
        "title": "Semaine 6: Fin de Stage et Tests Finaux",
        "content": "La sixième et dernière semaine de mon stage a été entièrement consacrée à la finalisation du projet. Après les premiers tests effectués la semaine précédente, j'ai continué à affiner le système en corrigeant les derniers bugs et en améliorant les performances générales. Cette phase finale a été cruciale pour assurer que tout fonctionne parfaitement avant la présentation du projet. \n\nEn parallèle des tests finaux, j'ai également préparé une présentation détaillée pour la réunion de fin de stage. Cette présentation devait non seulement montrer le fonctionnement du système, mais aussi mettre en évidence les défis rencontrés, les solutions apportées, et les résultats obtenus. La réunion de clôture a été l'occasion de présenter officiellement le projet à mon supérieur et de discuter des améliorations possibles pour l'avenir. Je suis reparti de cette expérience avec un sentiment de satisfaction, ayant appris énormément sur le développement de solutions d'intelligence artificielle et l'utilisation d'outils comme AWS."
    },
    {
        "title": "Conclusion du stage",
        "content": "Ce stage chez Asiaction a été une expérience enrichissante à bien des égards. Il m'a permis de plonger dans le monde de l'intelligence artificielle et de découvrir les nombreuses facettes de ce domaine en pleine expansion. J'ai non seulement pu développer des compétences techniques précieuses, notamment en programmation et en gestion de bases de données, mais aussi apprendre à utiliser des outils puissants comme AWS, qui se sont révélés indispensables pour mener à bien le projet. \n\nCette expérience m'a également montré l'importance de la persévérance face aux défis techniques, et l'impact d'une bonne gestion de projet sur la réussite des tâches complexes."
    }
]
