[
    {
        "title": "Présentation de l'entreprise",
        "content": "Introduction\nAsiaction est une société spécialisée dans la gestion de projets d'achats en Asie, principalement en Chine. Sa mission est de garantir la réussite des projets de ses clients en combinant des ressources techniques et humaines tout au long du processus d'approvisionnement.\n\nServices Principaux\nÉtude Sourcing : Identification et validation de fournisseurs chinois, fourniture d'offres conformes aux besoins des clients avec détails sur les prix et certifications.\nVérification de Société : Validation des documents légaux et certifications des entreprises, rapport détaillé avec illustrations.\nAudit d’Usine : Évaluation de la fiabilité des usines, observation des lignes de production, et rapport complet avec photos et avis de l’auditeur.\nAccompagnement Échantillonnage : Élaboration et vérification des échantillons, optimisation du transport des échantillons.\nGestion de Commande : Négociation des conditions d’achat, suivi de la production, inspection qualité des produits finis.\nInspection Produit : Contrôle qualité, vérification des spécifications, tests de fonctionnement, et rapport détaillé.\nSupervision de Chargement : Vérification des conteneurs et supervision du chargement avec rapport complet.\n\nPhilosophie et Promesse\nAsiaction s’engage à éviter les incompréhensions culturelles et linguistiques grâce à des interlocuteurs francophones. Ils assurent la fiabilité des informations et offrent des conseils personnalisés, visant à minimiser les problèmes post-vente et à consolider l'image de marque des clients.\n\nImplantation et Expérience\nAvec des bureaux à Londres, Guangzhou, Bordeaux et Dubaï, et une expérience dans l’importation de produits chinois, Asiaction a identifié plus de 2 400 usines, se positionnant comme un partenaire de confiance pour gérer efficacement les projets d'achats en Asie.\n\nAvantages de Travailler avec Asiaction\nExpertise technique et humaine : Agents expérimentés pour un suivi rigoureux.\nCommunication fluide : Interlocuteurs francophones pour éviter les malentendus.\nRéduction des risques : Vérification approfondie des fournisseurs.\nOptimisation Logistique : Solutions de transport optimisées pour réduire les coûts et respecter les délais.\n\nPour plus de détails, Asiaction propose des documents téléchargeables sur leurs services spécifiques.\n\nConclusion\nAsiaction se présente comme le partenaire idéal pour gérer vos projets d'achats en Asie, offrant une gamme complète de services pour assurer la réussite et la sécurité de vos transactions."
    },
    {
        "title": "Première semaine dans l'entreprise",
        "content": "Lors de ma première semaine chez Asiaction, j'ai commencé par me familiariser avec le projet. L'objectif principal était de mettre en place une solution d'intelligence artificielle pour faciliter la sélection de mobilier. Cette phase initiale a consisté à rechercher des solutions potentielles et à entamer la rédaction d'un plan de projet. J'ai également commencé à identifier les outils nécessaires pour mener à bien cette mission."
    }, 
    {
        "title": "Deuxième semaine",
        "content": "Durant la deuxième semaine, j'ai commencé à utiliser les premiers outils nécessaires pour le projet. La prise en main a été assez compliquée, car c'était une nouveauté pour moi. J'ai d'abord essayé de me familiariser avec Google, mais rapidement, j'ai dû me rediriger vers AWS. L'interface peu intuitive et la documentation peu utile ont rendu cette transition encore plus difficile."
    },
    {
        "title": "Mais en fait, c'est quoi AWS ?",
        "content": "AWS, ou Amazon Web Services, est une plateforme de services cloud proposée par Amazon. Elle permet aux entreprises et aux développeurs d'accéder à une large gamme de services informatiques via Internet, sans avoir besoin de gérer physiquement des serveurs ou des infrastructures.\n\nPoints clés pour comprendre AWS :\n- **Services Cloud** : AWS offre des services en ligne comme le stockage de données, la puissance de calcul, les bases de données, et bien plus encore. Plutôt que d'acheter et de maintenir des serveurs, les utilisateurs peuvent louer ces services en fonction de leurs besoins.\n- **Scalabilité** : AWS permet aux utilisateurs d'ajuster facilement la quantité de ressources informatiques qu'ils utilisent. Si ton application a besoin de plus de puissance pendant une période de forte demande, AWS peut automatiquement augmenter les ressources disponibles.\n- **Coût** : Avec AWS, tu ne paies que pour ce que tu utilises. Cela rend les coûts beaucoup plus flexibles et souvent plus abordables que d'investir dans une infrastructure matérielle traditionnelle.\n- **Outils et Services Spécialisés** : AWS propose des services spécialisés pour différents types de projets, notamment l'intelligence artificielle (IA), l'Internet des objets (IoT), l'analyse de données, et bien d'autres. Par exemple, Amazon SageMaker est un outil AWS qui permet de créer, entraîner, et déployer des modèles d'IA facilement.\n\nEn résumé, AWS est une solution puissante pour les entreprises et les développeurs qui souhaitent accéder à des ressources informatiques flexibles et à des outils spécialisés sans avoir à investir massivement dans du matériel."
    },
    {
        "title": "Semaine 3 : Premiers codes",
        "content": "Lors de la troisième semaine, j'ai commencé à écrire les premiers codes pour le projet. L'objectif principal était de rechercher des images et d'extraire celles présentes dans des fichiers PDF. Cette phase initiale de codage a permis de poser les bases techniques du projet."
    },
    {
        "title": "Semaine 4 : Travail sur l'extraction et mise en place de la base de données",
        "content": "La quatrième semaine a été marquée par un travail intense sur l'extraction des images. J'ai également mis en place une base de données pour le stockage de ces images, ce qui a permis de structurer les informations extraites et de préparer la suite du projet."
    },
    {
        "title": "Semaine 5 : Mise en place du projet et premiers tests",
        "content": "Durant la cinquième semaine, j'ai intégré le projet dans un site web pour effectuer les premiers gros tests. Plusieurs centaines de PDF ont été ajoutés et les images ont été extraites. Cette semaine a également été consacrée au débogage des différents problèmes rencontrés au cours de cette phase de test."
    },
    {
        "title": "Semaine 6 : Fin de stage et tests finaux",
        "content": "La sixième et dernière semaine de stage a été dédiée aux tests finaux et aux réglages des derniers petits problèmes. J'ai également participé à une réunion de fin pour présenter le projet et le rendre officiellement."
    },
    {
        "title": "Conclusion du Stage",
        "content": "Ce stage chez Asiaction a été une expérience enrichissante qui m'a permis de découvrir le monde de l'intelligence artificielle. J'ai acquis de nouvelles compétences, notamment grâce à l'utilisation des outils AWS, qui seront un atout précieux pour mes futurs projets."
    }
]
